package com.qnpeople.rnd.pms.apis.system.menu.service;

import com.qnpeople.rnd.pms.common.domain.executor.service.QNPWebBaseService;

/**
 * ================================================================================
 * @Project		: hdcci-man-month-mgmt-application
 * @Package		: com.qnpeople.rnd.pms.apis.system.menu.service
 * @Filename		: MenuMgmtService.java
 * ====================================
 *  version      date              author 						description
 * =================================================================================
 *  1.0		2026.10.04.     BeamSeok.Seo				Initialization
 *  =================================================================================
 *  [ 설명 ]
 *  웹 어플리케이션의 시스템 영역의 메뉴 정보 관리를 위한 실질적인 작업을 수행하기 위한 인터페이스 클래스 
 * =================================================================================
 */
public interface MenuMgmtService extends QNPWebBaseService {


	//////////////////////////////////////////////////////////////////////////////
	//	시스템 메뉴 관리 모듈 정의
	//////////////////////////////////////////////////////////////////////////////
	
	
	//////////////////////////////////////////////////////////////////////////////
	//	시스템 메뉴 서비스 모듈 정의
	//////////////////////////////////////////////////////////////////////////////	
}
